resources/NotificationService.xml

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10-b140319.1121 svn-revision#7b34660d6bc70e587e8ec81a17e4d76af68816a6. -->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
             xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://eu.europa.ec.dgt.epoetry"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="http://eu.europa.ec.dgt.epoetry" name="EpoetryNotificationReceiverService">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://eu.europa.ec.dgt.epoetry"
                        schemaLocation="NotificationService_xsd.xml"/>
        </xsd:schema>
    </types>
    <message name="receiveNotification">
        <part name="parameters" element="tns:receiveNotification"/>
    </message>
    <message name="receiveNotificationResponse">
        <part name="parameters" element="tns:receiveNotificationResponse"/>
    </message>
    <message name="DGTNotificationException">
        <part name="fault" element="tns:DGTNotificationException"/>
    </message>
    <portType name="EpoetryNotificationReceiver">
        <operation name="receiveNotification">
            <input wsam:Action="http://eu.europa.ec.dgt.epoetry/EpoetryNotificationReceiver/receiveNotificationRequest"
                   message="tns:receiveNotification"/>
            <output wsam:Action="http://eu.europa.ec.dgt.epoetry/EpoetryNotificationReceiver/receiveNotificationResponse"
                    message="tns:receiveNotificationResponse"/>
            <fault message="tns:DGTNotificationException" name="DGTNotificationException"
                   wsam:Action="http://eu.europa.ec.dgt.epoetry/EpoetryNotificationReceiver/receiveNotification/Fault/DGTNotificationException"/>
        </operation>
    </portType>
    <binding name="EpoetryNotificationReceiverPortBinding" type="tns:EpoetryNotificationReceiver">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="receiveNotification">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
            <fault name="DGTNotificationException">
                <soap:fault name="DGTNotificationException" use="literal"/>
            </fault>
        </operation>
    </binding>
    <service name="EpoetryNotificationReceiverService">
        <port name="EpoetryNotificationReceiverPort" binding="tns:EpoetryNotificationReceiverPortBinding">
            <soap:address location="http://localhost:8001/dgt/epoetry-client/EpoetryNotificationReceiverService"/>
        </port>
    </service>
</definitions>